InformationRegisters/НастройкиУчетныхЗаписейВидеоконференций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетныхЗаписейВидеоконференций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТокенОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействияТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиВидеоконференций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/УчетныеЗаписиВидеоконференций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиВидеоконференций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриветственноеСообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ВидеоконференцииСлужебный/Ext/Module.bsl
//@Strict-types

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныВнешниеПользователиСистемыВзаимодействия() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.20.0") >= 0;
	
КонецФункции

Функция УчетныеЗаписи() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписиВидеоконференций.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиВидеоконференций.ПриветственноеСообщение КАК ПриветственноеСообщение,
	|	УчетныеЗаписиВидеоконференций.Сервис
	|ИЗ
	|	Справочник.УчетныеЗаписиВидеоконференций КАК УчетныеЗаписиВидеоконференций
	|ГДЕ
	|	НЕ УчетныеЗаписиВидеоконференций.ПометкаУдаления
	|	И УчетныеЗаписиВидеоконференций.Сервис В (&Сервисы)";
	
	Запрос.УстановитьПараметр("Сервисы", Видеоконференции.ИспользуемыеСервисы());
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция НастроенныеУчетныеЗаписи() Экспорт
	
	НастроенныеУчетныеЗаписи = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиУчетныхЗаписей.УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.НастройкиУчетныхЗаписейВидеоконференций КАК НастройкиУчетныхЗаписей
	|ГДЕ
	|	НастройкиУчетныхЗаписей.УчетнаяЗапись.Сервис В (&Сервисы)";
	
	Запрос.УстановитьПараметр("Сервисы", Видеоконференции.ИспользуемыеСервисы());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НастроенныеУчетныеЗаписи.Добавить(Выборка.УчетнаяЗапись);
	КонецЦикла;
	
	Возврат НастроенныеУчетныеЗаписи;
	
КонецФункции

// Параметры:
//  Сервис - Строка
//  Идентификатор - Строка
// 
// Возвращаемое значение:
//  СправочникСсылка.УчетныеЗаписиВидеоконференций
Функция УчетнаяЗаписьПоИдентификатору(Сервис, Идентификатор) Экспорт
	
	Результат = Справочники.УчетныеЗаписиВидеоконференций.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиУчетныхЗаписей.УчетнаяЗапись
		|ИЗ
		|	РегистрСведений.НастройкиУчетныхЗаписейВидеоконференций КАК НастройкиУчетныхЗаписей
		|ГДЕ
		|	ВЫРАЗИТЬ(НастройкиУчетныхЗаписей.ИдентификаторПользователя КАК СТРОКА(200)) = &ИдентификаторПользователя
		|	И НастройкиУчетныхЗаписей.УчетнаяЗапись.Сервис = &Сервис";
		
		Запрос.УстановитьПараметр("Сервис", Сервис);
		Запрос.УстановитьПараметр("ИдентификаторПользователя", Идентификатор);
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Результат = Выборка.УчетнаяЗапись;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  УчетныеЗаписи - Массив Из СправочникСсылка.УчетныеЗаписиВидеоконференций
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
// * Ключ - СправочникСсылка.УчетныеЗаписиВидеоконференций
// * Значение - Строка
Функция СервисыУчетныхЗаписей(УчетныеЗаписи) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъектов(УчетныеЗаписи, "Сервис");
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
// 
// Возвращаемое значение:
//  Строка
Функция СервисУчетнойЗаписи(УчетнаяЗапись) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗапись, "Сервис");
	
КонецФункции

// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций
// 
// Возвращаемое значение:
//  См. НовыеРеквизитыУчетнойЗаписи
Функция РеквизитыУчетнойЗаписи(УчетнаяЗапись) Экспорт
	
	РеквизитыУчетнойЗаписи = НовыеРеквизитыУчетнойЗаписи();
	
	Если ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		РеквизитыУчетныхЗаписей = РеквизитыУчетныхЗаписей(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(УчетнаяЗапись));
		РеквизитыУчетнойЗаписи = РеквизитыУчетныхЗаписей[УчетнаяЗапись];
	КонецЕсли;
	
	Возврат РеквизитыУчетнойЗаписи;
	
КонецФункции

// Параметры:
//  Адрес - Строка
//  Защищенное - Булево
// 
// Возвращаемое значение:
//  HTTPСоединение
Функция НовоеHTTPСоединение(Адрес, Защищенное = Истина) Экспорт
	
	Прокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("http://" + Адрес);
	ТаймаутСоединения = 10;
	
	Если Защищенное Тогда
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(, Новый СертификатыУдостоверяющихЦентровОС);
		Соединение = Новый HTTPСоединение(Адрес, , , , Прокси, ТаймаутСоединения, ЗащищенноеСоединение);
	Иначе
		Соединение = Новый HTTPСоединение(Адрес, , , , Прокси, ТаймаутСоединения);
	КонецЕсли;
	
	Возврат Соединение;
	
КонецФункции

Функция МетодыЗапросов() Экспорт
	
	МетодыЗапросов = Новый Структура();
	
	МетодыЗапросов.Вставить("Получить", "GET");
	МетодыЗапросов.Вставить("Записать", "PUT");
	МетодыЗапросов.Вставить("ОтправитьДляОбработки", "POST");
	МетодыЗапросов.Вставить("Удалить", "DELETE");
	МетодыЗапросов.Вставить("Изменить", "PATCH");
	
	Возврат МетодыЗапросов;
	
КонецФункции

// Параметры:
//  РеквизитыУчетнойЗаписи - См. НовыеРеквизитыУчетнойЗаписи
Процедура СохранитьНастройкиАвторизации(РеквизитыУчетнойЗаписи) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.НастройкиУчетныхЗаписейВидеоконференций.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, РеквизитыУчетнойЗаписи);
	
	МенеджерЗаписи.УчетнаяЗапись = РеквизитыУчетнойЗаписи.УчетнаяЗапись;
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// Параметры:
//  Соединение - HTTPСоединение
//  Метод - Строка
//  Запрос - HTTPЗапрос
//  ВызыватьИсключение - Булево
// 
// Возвращаемое значение:
//  См. НовыйРезультатЗапроса
Функция ВыполнитьHTTPЗапрос(Соединение, Метод, Запрос, ВызыватьИсключение = Истина) Экспорт
	
	РезультатЗапроса = НовыйРезультатЗапроса();
	РезультатЗапроса.Сервис = Соединение.Сервер;
	РезультатЗапроса.Метод = Метод;
	РезультатЗапроса.АдресРесурса= СтрШаблон("%1/%2", Соединение.Сервер, Запрос.АдресРесурса);
	РезультатЗапроса.ТекстЗапроса = Запрос.ПолучитьТелоКакСтроку();
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод(Метод, Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		РезультатЗапроса.Ошибка = Истина;
		РезультатЗапроса.ИнформацияОбОшибке = ИнформацияОбОшибке;
		
		ОписаниеОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка при выполнении HTTP запроса:
						|Метод: %1
						|Адрес ресурса: %2
						|Текст запроса: %3
						|Информация об ошибке: %4'"),
		РезультатЗапроса.Метод,
		РезультатЗапроса.АдресРесурса,
		РезультатЗапроса.ТекстЗапроса,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
		ЗаписьЖурналаРегистрации(
			СтрШаблон(НСтр("ru = 'Выполнение запроса к %1'", ОбщегоНазначения.КодОсновногоЯзыка()), РезультатЗапроса.Сервис),
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
		Если ВызыватьИсключение Тогда
			ВызватьИсключение ТекстИсключения(
				СтрШаблон(НСтр("ru = 'Не удалось выполнить запрос к сервису %1'"), РезультатЗапроса.Сервис));
		КонецЕсли;
	КонецПопытки;
	
	РезультатЗапроса.Ответ = Ответ;
	РезультатЗапроса.ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	РезультатЗапроса.КодСостояния = Ответ.КодСостояния;
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Параметры:
//  СтрокаJSON - Строка
//  ПрочитатьВСоответствие - Булево
// 
// Возвращаемое значение:
// - Неопределено
// - Структура
// - Соответствие Из КлючИЗначение:
// * Ключ - Строка
// * Значение - Строка, Число, Булево -
Функция ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие);
	ЧтениеJSON.Закрыть();
	
	//@skip-check constructor-function-return-section
	Возврат Результат;
	
КонецФункции

// Параметры:
//  Данные - Структура
// 
// Возвращаемое значение:
// Строка
Функция ЗаписьJSON(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "", Истина);
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

// Параметры:
//  РезультатЗапроса - См. ВыполнитьHTTPЗапрос
//  ПрочитатьВСоответствие - Булево
Процедура ПрочитатьHTTPОтвет(РезультатЗапроса, ПрочитатьВСоответствие = Ложь) Экспорт

	РезультатЗапроса.ТелоОтвета = РезультатЗапроса.Ответ.ПолучитьТелоКакСтроку();
	ПрочитатьТелоОтвета(РезультатЗапроса, ПрочитатьВСоответствие);
	
КонецПроцедуры

Функция ТекстИсключения(Текст) Экспорт

	Возврат СтрШаблон(
		НСтр("ru = '%1
		|Обратитесь к администратору.
		|Подробности в журнале регистрации.'"), Текст);

КонецФункции

#Область Конструкторы

// Возвращаемое значение:
//  Структура:
// * Имя - Строка -
// * Представление - Строка -
// * Картинка - Картинка -
// * АдресЗапроса - Строка -
// * ТребуетсяАвторизацияПользователя - Булево -
// * ВозможнаРаботаСАккаунтомДругогоПользователя - Булево -
// * ДоступенЧат - Булево -
// * ДоступноПланирование - Булево -
// * СтартПоСсылке - Булево -
// * ЭтоСистемаВзаимодействия - Булево -
// * УчетнаяЗаписьПоУмолчанию - СправочникСсылка.УчетныеЗаписиВидеоконференций -
// * Авторизация - Структура -:
// ** НеТребуется - Булево -
// ** Базовая - Булево -
// ** ПротоколOAuth - Булево -
// ** СтрокаАвторизацииOAuth - Строка -
// * НастройкиОтображения - Структура -:
// ** Кнопки - Структура -:
// *** Старт - Структура -:
// **** Использование - Булево -
// **** Заголовок - Строка -
// *** Перейти - Структура -:
// **** Использование - Булево -
// **** Заголовок - Строка -
// *** Запланировать - Структура -:
// **** Использование - Булево -
// **** Заголовок - Строка -
// *** Отменить - Структура -:
// **** Использование - Булево -
// **** Заголовок - Строка -
Функция НовыеДанныеСервиса() Экспорт
	
	ДанныеСервиса = Новый Структура();
	ДанныеСервиса.Вставить("Имя", "");
	ДанныеСервиса.Вставить("Представление", "");
	ДанныеСервиса.Вставить("Картинка", Новый Картинка());
	ДанныеСервиса.Вставить("АдресЗапроса", "");
	ДанныеСервиса.Вставить("ТребуетсяАвторизацияПользователя", Ложь);
	ДанныеСервиса.Вставить("ВозможнаРаботаСАккаунтомДругогоПользователя", Ложь);
	ДанныеСервиса.Вставить("ДоступенЧат", Ложь);
	ДанныеСервиса.Вставить("ДоступноПланирование", Ложь);
	ДанныеСервиса.Вставить("СтартПоСсылке", Ложь);
	ДанныеСервиса.Вставить("ЭтоСистемаВзаимодействия", Ложь);
	ДанныеСервиса.Вставить("УчетнаяЗаписьПоУмолчанию", Справочники.УчетныеЗаписиВидеоконференций.ПустаяСсылка());
	
	Авторизация = Новый Структура();
	Авторизация.Вставить("НеТребуется", Ложь);
	Авторизация.Вставить("Базовая", Ложь);
	Авторизация.Вставить("ПротоколOAuth", Ложь);
	Авторизация.Вставить("СтрокаАвторизацииOAuth", "");
	
	ДанныеСервиса.Вставить("Авторизация", Авторизация);
	
	КнопкаСтарт = Новый Структура();
	КнопкаСтарт.Вставить("Использование", Ложь);
	КнопкаСтарт.Вставить("Заголовок", "");
	
	КнопкаПерейти = Новый Структура();
	КнопкаПерейти.Вставить("Использование", Ложь);
	КнопкаПерейти.Вставить("Заголовок", "");
	
	КнопкаЗапланировать = Новый Структура();
	КнопкаЗапланировать.Вставить("Использование", Ложь);
	КнопкаЗапланировать.Вставить("Заголовок", "");
	
	КнопкаОтменить = Новый Структура();
	КнопкаОтменить.Вставить("Использование", Истина);
	КнопкаОтменить.Вставить("Заголовок", "");
	
	Кнопки = Новый Структура();
	Кнопки.Вставить("Старт", КнопкаСтарт);
	Кнопки.Вставить("Перейти", КнопкаПерейти);
	Кнопки.Вставить("Запланировать", КнопкаЗапланировать);
	Кнопки.Вставить("Отменить", КнопкаОтменить);
	
	НастройкиОтображения = Новый Структура();
	НастройкиОтображения.Вставить("Кнопки", Кнопки);
	
	ДанныеСервиса.Вставить("НастройкиОтображения", НастройкиОтображения);
	
	Возврат ДанныеСервиса
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Сервис - Строка -
// * Метод - Строка -
// * АдресРесурса - Строка -
// * ТекстЗапроса - Строка -
// * Ответ - Неопределено, HTTPОтвет -
// * КодСостояния - Число -
// * ТелоОтвета - Строка -
// * ОтветОбъект - См. ПарсерJSON
// * Ошибка - Булево -
// * ИнформацияОбОшибке - Неопределено, ИнформацияОбОшибке -
Функция НовыйРезультатЗапроса() Экспорт
	
	РезультатЗапроса = Новый Структура();
	
	РезультатЗапроса.Вставить("Сервис", "");
	РезультатЗапроса.Вставить("Метод", "");
	РезультатЗапроса.Вставить("АдресРесурса", "");
	РезультатЗапроса.Вставить("ТекстЗапроса", "");
	РезультатЗапроса.Вставить("Ответ", Неопределено);
	РезультатЗапроса.Вставить("КодСостояния", 0);
	РезультатЗапроса.Вставить("ТелоОтвета", "");
	РезультатЗапроса.Вставить("ОтветОбъект", Неопределено);
	РезультатЗапроса.Вставить("Ошибка", Ложь);
	РезультатЗапроса.Вставить("ИнформацияОбОшибке", Неопределено);
	
	Возврат РезультатЗапроса;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Состояние - Строка -
// * Ссылка - Строка -
// * СсылкаОрганизатора - Строка -
// * СсылкаКандидата - Строка -
// * Описание - Строка -
// * Идентификатор - Строка -
// * Данные - Неопределено, Структура -
Функция НовыеДанныеВидеоконференции() Экспорт
	
	ДанныеВидеоконференции = Новый Структура;
	ДанныеВидеоконференции.Вставить("Состояние", "");
	ДанныеВидеоконференции.Вставить("Ссылка", "");
	ДанныеВидеоконференции.Вставить("СсылкаОрганизатора", "");
	ДанныеВидеоконференции.Вставить("СсылкаКандидата", "");
	ДанныеВидеоконференции.Вставить("Описание", "");
	ДанныеВидеоконференции.Вставить("Идентификатор", "");
	ДанныеВидеоконференции.Вставить("Данные", Неопределено);
	
	Возврат ДанныеВидеоконференции;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Тема - Строка -
// * Начало - Дата -
// * Продолжительность - Число -
// * Идентификатор - Строка -
// * Участники - ТаблицаЗначений -:
// ** ФИО - Строка
// ** Представление - Строка
// ** АдресЭП - Строка
// ** ИдентификаторПользователяИБ - УникальныйИдентификатор
Функция НовыеНастройкиВидеоконференции() Экспорт
	
	Настройки = Новый Структура;
	Настройки.Вставить("Тема", "");
	Настройки.Вставить("Начало", Дата(1, 1, 1));
	Настройки.Вставить("Продолжительность", 0);
	Настройки.Вставить("Идентификатор", "");
	
	Участники = Новый ТаблицаЗначений;
	Участники.Колонки.Добавить("ФИО", Новый ОписаниеТипов("Строка"));
	Участники.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	Участники.Колонки.Добавить("АдресЭП", Новый ОписаниеТипов("Строка"));
	Участники.Колонки.Добавить("ИдентификаторПользователяИБ", Новый ОписаниеТипов("УникальныйИдентификатор"));
	
	Настройки.Вставить("Участники", Участники);
	
	Возврат Настройки;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * ФИО - Строка
// * Представление - Строка
// * АдресЭП - Строка
// * ИдентификаторПользователяИБ - УникальныйИдентификатор
Функция НовыеДанныеПользователя() Экспорт
	
	ДанныеПользователя = Новый Структура;
	ДанныеПользователя.Вставить("ФИО", "");
	ДанныеПользователя.Вставить("Представление", "");
	ДанныеПользователя.Вставить("АдресЭП", "");
	ДанныеПользователя.Вставить("ИдентификаторПользователяИБ", Новый УникальныйИдентификатор());
	
	Возврат ДанныеПользователя;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Сервис - Строка
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций -
// * ПриветственноеСообщение - Строка -
// * ТокенДоступа - Строка -
// * ТокенОбновления - Строка -
// * ДатаОкончанияДействияТокена - Дата -
// * ИмяПользователя - Строка -
// * ИдентификаторПользователя - Строка -
// * Предупреждение - Строка -
Функция НовыеРеквизитыУчетнойЗаписи() Экспорт
	
	РеквизитыУчетнойЗаписи = Новый Структура();
	РеквизитыУчетнойЗаписи.Вставить("Сервис", "");
	РеквизитыУчетнойЗаписи.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиВидеоконференций.ПустаяСсылка());
	РеквизитыУчетнойЗаписи.Вставить("ПриветственноеСообщение", "");
	РеквизитыУчетнойЗаписи.Вставить("ТокенДоступа", "");
	РеквизитыУчетнойЗаписи.Вставить("ТокенОбновления", "");
	РеквизитыУчетнойЗаписи.Вставить("ДатаОкончанияДействияТокена", Дата(1, 1, 1));
	РеквизитыУчетнойЗаписи.Вставить("ИмяПользователя", "");
	РеквизитыУчетнойЗаписи.Вставить("ИдентификаторПользователя", "");
	РеквизитыУчетнойЗаписи.Вставить("Предупреждение", "");
	
	Возврат РеквизитыУчетнойЗаписи;
	
КонецФункции

// Возвращаемое значение:
//  Структура:
// * Сервис - Строка
// * УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиВидеоконференций -
// * Подключено - Булево -
// * ИмяПользователя - Строка -
Функция НовыеДанныеОДоступностиСервиса() Экспорт
	
	ДанныеОДоступностиСервиса = Новый Структура();
	ДанныеОДоступностиСервиса.Вставить("Сервис", "");
	ДанныеОДоступностиСервиса.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиВидеоконференций.ПустаяСсылка());
	ДанныеОДоступностиСервиса.Вставить("Подключено", Ложь);
	ДанныеОДоступностиСервиса.Вставить("ИмяПользователя", "");
	
	Возврат ДанныеОДоступностиСервиса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Параметры:
//  УчетныеЗаписи - Массив из СправочникСсылка.УчетныеЗаписиВидеоконференций
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
// * Ключ - СправочникСсылка.УчетныеЗаписиВидеоконференций
// * Значение - См. НовыеРеквизитыУчетнойЗаписи
Функция РеквизитыУчетныхЗаписей(УчетныеЗаписи)

	РеквизитыУчетныхЗаписей = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетныеЗаписиВидеоконференций.Ссылка КАК УчетнаяЗапись,
	|	УчетныеЗаписиВидеоконференций.Сервис КАК Сервис,
	|	УчетныеЗаписиВидеоконференций.ПриветственноеСообщение,
	|	НастройкиУчетныхЗаписей.ТокенДоступа КАК ТокенДоступа,
	|	НастройкиУчетныхЗаписей.ТокенОбновления КАК ТокенОбновления,
	|	НастройкиУчетныхЗаписей.ДатаОкончанияДействияТокена КАК ДатаОкончанияДействияТокена,
	|	НастройкиУчетныхЗаписей.ИмяПользователя КАК ИмяПользователя
	|ИЗ
	|	Справочник.УчетныеЗаписиВидеоконференций КАК УчетныеЗаписиВидеоконференций
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетныхЗаписейВидеоконференций КАК НастройкиУчетныхЗаписей
	|		ПО (НастройкиУчетныхЗаписей.УчетнаяЗапись = УчетныеЗаписиВидеоконференций.Ссылка)
	|ГДЕ
	|	УчетныеЗаписиВидеоконференций.Ссылка В (&УчетныеЗаписи)";

	Запрос.УстановитьПараметр("УчетныеЗаписи", УчетныеЗаписи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		РеквизитыУчетнойЗаписи = НовыеРеквизитыУчетнойЗаписи();
		ЗаполнитьЗначенияСвойств(РеквизитыУчетнойЗаписи, Выборка);
		РеквизитыУчетныхЗаписей.Вставить(Выборка.УчетнаяЗапись, РеквизитыУчетнойЗаписи);
	КонецЦикла;
	
	Возврат РеквизитыУчетныхЗаписей;

КонецФункции

Процедура ПрочитатьТелоОтвета(РезультатЗапроса, ПрочитатьВСоответствие = Ложь)
	
	ОтветОбъект = Неопределено;
	
	СтрокаJSON = РезультатЗапроса.ТелоОтвета;
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОтветОбъект = ПарсерJSON(СтрокаJSON, ПрочитатьВСоответствие);
	Исключение
		ОписаниеОшибки = СтрШаблон(
			НСтр("ru = 'Невозможно прочитать тело запроса JSON:
						|Читаемый объект(первые 500 символов): %1
						|Исходный запрос:
						|Метод: %2
						|Адрес ресурса: %3
						|Тело запроса: %4
						|Код состояния: %5
						|Информация об ошибке: %6'"),
			Лев(Строка(СтрокаJSON), 500),
			РезультатЗапроса.Метод,
			РезультатЗапроса.АдресРесурса,
			РезультатЗапроса.ТекстЗапроса,
			РезультатЗапроса.КодСостояния,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			СтрШаблон(НСтр("ru = 'Чтение ответа от %1'", ОбщегоНазначения.КодОсновногоЯзыка()), РезультатЗапроса.Сервис),
			УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки);
		
		ВызватьИсключение ТекстИсключения(
			СтрШаблон(НСтр("ru = 'Не удалось прочитать ответ сервиса %1'"), РезультатЗапроса.Сервис));
	КонецПопытки;
	
	РезультатЗапроса.ОтветОбъект = ОтветОбъект;
	
КонецПроцедуры

#КонецОбласти
